---
kind: type
id: T:Autodesk.Revit.DB.ImageFileType
source: html/581facef-c495-9017-8e99-2181078d11a5.htm
---
# Autodesk.Revit.DB.ImageFileType

This enum is used to define exported file type.

## Syntax (C#)
```csharp
public enum ImageFileType
```